[
  {
    "nombreapp": "Emoji Clicker",
    "descripcion": "Juego web interactivo desarrollado con HTML, CSS y JavaScript en el que el jugador debe atrapar emojis buenos y evitar los malos mientras sube de nivel. Incluye diferentes modos de dificultad, enemigos como demonios y bombas, y un sistema de puntuación con metas representadas por trofeos. Tiene animaciones fluidas, efectos visuales de victoria, y es compatible con dispositivos móviles. El objetivo es lograr la mayor puntuación posible alcanzando varios trofeos.",
    "icono": "https://i.imgur.com/kQKfoAV.png",
    "integrantes": [
      "Andres De la rue",
      "Ivan Sterling",
      "Andres Castillo"
    ],
    "actividad": "Webintoapp",
    "url": "https://andresdlrg2007.github.io/EMOJI-CLICKER"
  },
  {
    "nombreapp": "Color Blast",
    "descripcion": "Color Blast es un juego web interactivo desarrollado con HTML, CSS y JavaScript, en el que el jugador debe eliminar bloques de colores iguales haciendo clic en grupos de dos o más del mismo color...",
    "icono": "https://i.imgur.com/8Dh7gBf.png",
    "integrantes": [
      "Andres De la rue",
      "Ivan Sterling"
    ],
    "actividad": "PWA",
    "url": "https://andresdlrg2007.github.io/pwa-game-color-blast"
  },
  {
    "nombreapp": "Herencia Futbolera",
    "descripcion": "Herencia Futbolera es una aplicación que permite a los aficionados del fútbol explorar la historia de los clubes más emblemáticos del mundo mediante sus camisetas históricas...",
    "icono": "https://i.imgur.com/CETFopi.png",
    "integrantes": [
      "Andres De la rue",
      "Ivan Sterling"
    ],
    "actividad": "Webview original",
    "url": "https://andresdlrg2007.github.io/Herencia-Futbolera"
  },
  {
    "nombreapp": "Star Wars Encyclopedia",
    "descripcion": "Enciclopedia de Star Wars con datos esenciales y un minijuego estilo Wordle donde adivinas personajes...",
    "icono": "https://i.imgur.com/ab0Mqa4.png",
    "integrantes": [
      "Andres De la rue"
    ],
    "actividad": "Webview con API – individual",
    "url": "https://andresdlrg2007.github.io/app-de-starwars"
  },
  {
    "nombreapp": "Lista de tareas remota",
    "descripcion": "Una app de tareas con sincronización en tiempo real mediante Firebase, disponible como APK y versión web. Permite crear, ver y organizar pendientes desde cualquier dispositivo con actualización inmediata y almacenamiento en la nube.",
    "icono": "https://i.imgur.com/xwkH4Se.png",
    "integrantes": [
      "Andres De la rue"
    ],
    "actividad": "Firebase (proyecto personal)",
    "url": "https://andresdlrg2007.github.io/app-de-tareas/inicio_tareas.html"
  },
  {
    "nombreapp": "Trivia musical",
    "descripcion": "Una app de trivia musical que obtiene datos de una API externa para generar preguntas sobre canciones, artistas y letras. Presenta una interfaz ligera y dinámica que permite responder en tiempo real y practicar consumo de servicios REST.",
    "icono": "https://i.imgur.com/JhWjcI1.png",
    "integrantes": [
      "Andres De la rue"
    ],
    "actividad": "Capacitor",
    "url": "https://drive.google.com/file/d/1l3czYl_MHWkhEZO8TCn7rDH4wNu89Id9/view?usp=drive_link"
  },
  {
  "nombreapp": "SpendControl",
  "descripcion": "Una aplicación de finanzas personales que permite registrar montos de ingresos y gastos y gestionarlos fácilmente. El usuario puede agregar nuevos movimientos, editarlos o eliminarlos cuando sea necesario, manteniendo un historial actualizado que le ayuda a entender en qué se está usando su dinero y llevar un control más ordenado de sus finanzas.",
  "icono": "https://i.imgur.com/szMgEWn.png",
  "integrantes": [
    "Andres de la rue",
    "Jaime Poveda"
  ],
  "actividad": "Capacitor - parejas",
  "url": "https://drive.google.com/file/d/1pOSTlnJcg1rVf6DBEvpZ57MF5s_GXtpp/view?usp=drive_link"
},
{
  "nombreapp": "Instragram Supabase",
  "descripcion": "Una aplicación tipo Instagram construida con Supabase, donde los usuarios pueden crear una cuenta, subir sus propias fotos y ver las publicaciones de otras personas en un feed compartido. Permite dejar comentarios, dar ‘like’, revisar el perfil personal con todas las fotos publicadas y gestionar el propio contenido, incluyendo la posibilidad de eliminar únicamente las fotos que pertenecen al usuario.",
  "icono": "https://i.imgur.com/t1UsXsI.png",
  "integrantes": [
    "Andres de la rue",
    "Jaime Poveda",
    "Ivan Sterling"
  ],
  "actividad": "Capacitor dashboard – réplica",
  "url": "https://drive.google.com/file/d/1d2CT5amBY3R-1JVxTD_i_asBG7wMfJod/view?usp=drive_link"
},
{
  "nombreapp": "Yu-Gi-Oh! app",
  "descripcion": "Una aplicación dedicada a jugadores de Yu-Gi-Oh! que permite explorar el catálogo de cartas, consultar detalles completos de cada una y construir mazos personalizados para distintas estrategias o eventos. La app utiliza Firebase para almacenar y sincronizar en la nube los mazos creados, de modo que el usuario puede acceder a ellos y gestionarlos fácilmente",
  "icono": "https://i.imgur.com/RcOtJQk.png",
  "integrantes": [
    "Andres de la rue"
  ],
  "actividad": "Capacitor Firebase – individual",
  "url": "https://drive.google.com/file/d/1ymWqFMpU4MEpi8QThjHznIcA9E0uUj05/view?usp=drive_link"
}
]